<?php

/*
|--------------------------------------------------------------------------
| 后台管理端配置文件
|--------------------------------------------------------------------------
| 定义管理端及管理员配置信息
|
*/

return [
    // 登录配置
    'login'     => [
        // 账号登录失败次数
        'account_error_limit'   => 5,
        // IP登录失败次数
        'ip_error_limit'        => 8,
        // 间隔时间多少分钟
        'login_gap'             => 10,
    ],
    // 注册配置
    'register'  => [
        // 注册用户默认status状态
        'add_status'    => 1,
        // 默认头像URL
        'add_avatar'    => '',
        // 新注册用户默认等级
        'add_level'     => 0,
        // 是否需要邀请码才能注册
        'add_invite'    => false,
        // 邀请码参数key名
        'invite_key'    => 'code',
        // 默认昵称前缀
        'user_prefix'   => ''
    ],
    // 用户签到
    'sign'      => [
        // 每日签到赠送积分
        'day'   => 5,
        // 每周签到赠送积分
        'week'  => 15,
    ],
];
